In [3]:
import numpy as np

In [4]:
import pandas as pd

In [5]:
np.random.seed(101)

In [6]:
df = pd.DataFrame(np.random.randn(5,4), ['a','b','c','d','e'], ['A','B','C','D'])

In [7]:
df

          A         B         C         D
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [8]:
df['A']

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: A, dtype: float64

In [9]:
df['A']['a']

2.706849839399938

In [10]:
type(df['A'])

pandas.core.series.Series

In [11]:
df.A

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: A, dtype: float64

In [12]:
df[['A','D']]

          A         D
a  2.706850  0.503826
b  0.651118  0.605965
c -2.018168 -0.589001
d  0.188695  0.955057
e  0.190794  0.683509

In [13]:
df['E - new'] = np.random.randn(5)

In [14]:
df

          A         B         C         D   E - new
a  2.706850  0.628133  0.907969  0.503826  0.302665
b  0.651118 -0.319318 -0.848077  0.605965  1.693723
c -2.018168  0.740122  0.528813 -0.589001 -1.706086
d  0.188695 -0.758872 -0.933237  0.955057 -1.159119
e  0.190794  1.978757  2.605967  0.683509 -0.134841

In [15]:
df['E - new'] = np.abs(df['A'] * df['B'])

In [16]:
df

          A         B         C         D   E - new
a  2.706850  0.628133  0.907969  0.503826  1.700261
b  0.651118 -0.319318 -0.848077  0.605965  0.207914
c -2.018168  0.740122  0.528813 -0.589001  1.493691
d  0.188695 -0.758872 -0.933237  0.955057  0.143196
e  0.190794  1.978757  2.605967  0.683509  0.377536

In [17]:
df.drop('E - new', axis = 1, inplace = True)

In [18]:
df

          A         B         C         D
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [19]:
df.drop('a', axis = 0)

          A         B         C         D
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [20]:
df

          A         B         C         D
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [21]:
df.drop('e', axis = 0, inplace = True)

In [22]:
df

          A         B         C         D
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057

In [23]:
df.shape

(4, 4)

In [24]:
df.loc['a']

A    2.706850
B    0.628133
C    0.907969
D    0.503826
Name: a, dtype: float64

In [25]:
df.iloc[0]

A    2.706850
B    0.628133
C    0.907969
D    0.503826
Name: a, dtype: float64

In [26]:
df.loc['a','A']

2.706849839399938

In [27]:
df.loc[['a','b'], ['A','B']]

          A         B
a  2.706850  0.628133
b  0.651118 -0.319318

In [28]:
df > 0

       A      B      C      D
a   True   True   True   True
b   True  False  False   True
c  False   True   True  False
d   True  False  False   True

In [29]:
bool_df = df > 0

In [30]:
df[bool_df]

          A         B         C         D
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d  0.188695       NaN       NaN  0.955057

In [31]:
df[df > 0]

          A         B         C         D
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d  0.188695       NaN       NaN  0.955057

In [32]:
df['A'] > 0

a     True
b     True
c    False
d     True
Name: A, dtype: bool

In [33]:
df[df['A'] > 0]

          A         B         C         D
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057

In [34]:
df[df['D'] < 0]

          A         B         C         D
c -2.018168  0.740122  0.528813 -0.589001

In [35]:
df.loc['a'] > 0

A    True
B    True
C    True
D    True
Name: a, dtype: bool

In [36]:
df[df['A'] < 0][['C','B']]

          C         B
c  0.528813  0.740122

In [37]:
df[(df['A'] > 0) & (df['B'] < 0)]

          A         B         C         D
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057

In [38]:
df.reset_index(level = 0)

  index         A         B         C         D
0     a  2.706850  0.628133  0.907969  0.503826
1     b  0.651118 -0.319318 -0.848077  0.605965
2     c -2.018168  0.740122  0.528813 -0.589001
3     d  0.188695 -0.758872 -0.933237  0.955057

In [39]:
df.set_index('D')

                  A         B         C
D
 0.503826  2.706850  0.628133  0.907969
 0.605965  0.651118 -0.319318 -0.848077
-0.589001 -2.018168  0.740122  0.528813
 0.955057  0.188695 -0.758872 -0.933237

In [50]:
ind_0 = ['A', 'A', 'A', 'B', 'B', 'B']
ind_1 = [1, 2, 3, 1, 2, 3]

In [51]:
zipped = list(zip(ind_0, ind_1))

In [52]:
zipped = pd.MultiIndex.from_tuples(zipped)

In [53]:
zipped

MultiIndex(levels=[['A', 'B'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [63]:
df = pd.DataFrame(np.random.randn(6,2), zipped, ['Col 1', 'Col 2'])

In [64]:
df

        Col 1     Col 2
A 1  2.084019 -0.376519
  2  0.230336  0.681209
  3  1.035125 -0.031160
B 1  1.939932 -1.005187
  2 -0.741790  0.187125
  3 -0.732845 -1.382920

In [65]:
df.loc['A']

      Col 1     Col 2
1  2.084019 -0.376519
2  0.230336  0.681209
3  1.035125 -0.031160

In [66]:
df.loc['A'].loc[1]

Col 1    2.084019
Col 2   -0.376519
Name: 1, dtype: float64

In [69]:
df.index.names = ['Groups', 'Numbers']

In [71]:
df.index.names

FrozenList(['Groups', 'Numbers'])

In [79]:
df.loc['B'].loc[3]['Col 2']

-1.3829200981158674

In [87]:
df.xs(1, level = 'Numbers')

           Col 1     Col 2
Groups
A       2.084019 -0.376519
B       1.939932 -1.005187

In [95]:
df.xs('A', level = 'Groups')

            Col 1     Col 2
Numbers
1        2.084019 -0.376519
2        0.230336  0.681209
3        1.035125 -0.031160